In [28]:
import pandas as pd

# Create sample DataFrames
df1 = pd.DataFrame({'key1': ['A', 'B', 'C'], 'value1': [1, 2, 3], 'value31': [44, 54, 66]})
df2 = pd.DataFrame({'key2': ['A', 'B', 'D'], 'value2': [4, 5, 6], 'value3': [46, 56, 66]})
df1.join(df2)

  key1  value1  value31 key2  value2  value3
0    A       1       44    A       4      46
1    B       2       54    B       5      56
2    C       3       66    D       6      66

In [30]:
# when index of both the df is of same name then need to add suffix
df3 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3], 'value3': [44, 54, 66]})
df4 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6], 'value3': [46, 56, 66]})
df1.join(df2, lsuffix='_df1', rsuffix='_df2')

  key1  value1  value31 key2  value2  value3
0    A       1       44    A       4      46
1    B       2       54    B       5      56
2    C       3       66    D       6      66